cases/F25_DUCT3D/case/0/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
// F25 -- square duct, fully developed (cyclic): p is uniform on the domain
// (pRefCell pins its level); zeroGradient at the walls.
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    inlet   { type cyclic; }
    outlet  { type cyclic; }
    wall    { type zeroGradient; }
}
