cases/F25_DUCT3D/case/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  F25 -- square duct.  Second-order central everywhere; the Laplacian (the
  term that sets the profile) is Gauss linear corrected -- the cubic mesh is
  orthogonal (checkMesh non-orthogonality 0, quoted in the pre-registration),
  so `corrected` adds nothing and is kept for the record.  Convection is null
  on the fully developed solution (v = w = 0, d/dx = 0 by the cyclic pair)
  and is kept central; the model in exact_f25.py integrates exactly the
  5-point cross-section stencil these schemes reduce to.
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object fvSchemes; }
ddtSchemes      { default steadyState; }
gradSchemes     { default Gauss linear; }
divSchemes      { default none; div(phi,U) Gauss linearUpwind grad(U); div((nuEff*dev2(T(grad(U))))) Gauss linear; }
laplacianSchemes{ default Gauss linear corrected; }
interpolationSchemes { default linear; }
snGradSchemes   { default corrected; }
